Ques 1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
ab=[4,8,15,16,23,42]

In [5]:
import pandas as pd
p=pd.Series(ab)

In [6]:
p

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Ques 2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [7]:
my_list=[10,55,78,94,64,"akshay","bhardwaj",47,63,21]

In [8]:
pda=pd.Series(my_list)

In [9]:
pda

0          10
1          55
2          78
3          94
4          64
5      akshay
6    bhardwaj
7          47
8          63
9          21
dtype: object

Q3. Create a Pandas DataFrame that contains the following data:
name:-alice,bob,claire:, age:-25,30,27:, gender:-female,male,female
Then, print the DataFrame.

In [15]:
data={"Name":["Alice","Bob","Claire"],
      "Age":[25,30,27],
      "Gender":["Female","Male","Female"]}

In [34]:
df2=pd.DataFrame(data)

In [35]:
df2

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Ques 4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

Ans: 1.Data Frame: A DataFrame in pandas is a two-dimensional, size-mutable, and heterogeneous tabular data structure. It's similar to a spreadsheet or a SQL table, where data is organized into rows and columns. Each column in a DataFrame is essentially a pandas Series.

2.Pandas.Series: A pandas Series, on the other hand, is a one-dimensional labeled array capable of holding data of any type (integer, string, float, etc.). It's like a single column of data, and it can be seen as a specialized dictionary where the keys are the index labels and the values are the data points.

In [17]:
##1.Pandas.Series
pda

0          10
1          55
2          78
3          94
4          64
5      akshay
6    bhardwaj
7          47
8          63
9          21
dtype: object

In [20]:
###2.DataFrame
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Ques 5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

In [21]:
import seaborn as sns

In [29]:
df1=sns.load_dataset("titanic")

In [30]:
###1.head()- this function is give the top 5 data of dataset:
df1.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [31]:
#####2.tail()- this function is gives you to last 5 data of dataset:
df1.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True

In [32]:
####3.describe()- this function is gives you to the descriptive statics of dataset like: mean,median,mode,count etc
df1.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

And many more functions present in pandas dataframe.

Ques 6. Which of the following is mutable in nature Series, DataFrame, Panel?

Ans: Series and DataFrame both are mutable in nature.

Ques 7. Create a DataFrame using multiple Series. Explain with an example.

In [37]:
data={"Name":["Alice","Bob","Claire"],
      "Age":[25,30,27],
      "Gender":["Female","Male","Female"]}

In [41]:
df3= pd.DataFrame(data)

In [42]:
df3

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

expalin:- In this example first we create a variable that contains dictonary type of data and after that we create a another variable name df3 and store the dataframe that contain data and run the that variable called df3.